cnlohr/ch32v003fun/minichlink/minichlink.c
	// DMDATA1:
	//  bit  7 = host-acknowledge.
	if( rr & 0x80 )
	{
		int ret = 0;
		int num_printf_chars = (rr & 0xf)-4;

		if( num_printf_chars > 0 && num_printf_chars <= 7)
		{
			if( num_printf_chars > 3 )
			{
				uint32_t r2;
				r = MCF.ReadReg32( dev, DMDATA1, &r2 );
				memcpy( buffer+3, &r2, num_printf_chars - 3 );
			}
			int firstrem = num_printf_chars;
			if( firstrem > 3 ) firstrem = 3;
			memcpy( buffer, ((uint8_t*)&rr)+1, firstrem );
			buffer[num_printf_chars] = 0;
			ret = num_printf_chars;
		}
		if( leaveflagA ) MCF.WriteReg32( dev, DMDATA1, leaveflagB );
		MCF.WriteReg32( dev, DMDATA0, leaveflagA ); // Write that we acknowledge the data.
		return ret;
	}
	else
	{
		return 0;
	}
}

int DefaultUnbrick( void * dev )
{
	// TODO: Why doesn't this work on the ESP32S2?

	printf( "Entering Unbrick Mode\n" );
	MCF.Control3v3( dev, 0 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.DelayUS( dev, 60000 );
	MCF.Control3v3( dev, 1 );
	MCF.DelayUS( dev, 100 );
	MCF.FlushLLCommands( dev );
	printf( "Connection starting\n" );
	int timeout = 0;
	int max_timeout = 500;
	uint32_t ds = 0;
	for( timeout = 0; timeout < max_timeout; timeout++ )
	{
		MCF.DelayUS( dev, 10 );
		MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // Shadow Config Reg
		MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // CFGR (1<<10 == Allow output from slave)
		MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // Bug in silicon?  If coming out of cold boot, and we don't do our little "song and dance" this has to be called.
		MCF.FlushLLCommands( dev );
		int r = MCF.ReadReg32( dev, DMSTATUS, &ds );
		printf( "/%d/%08x\n", r, ds );
		MCF.FlushLLCommands( dev );
		if( ds != 0xffffffff && ds != 0x00000000 ) break;
	}

	// Make sure we are in halt.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate a halt request.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // No, really make sure.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 );

//  Many times we would clear the halt request, but in this case, we want to just leave it here, to prevent it from booting.
//  TODO: Experiment and see if this is needed/wanted in cases.  NOTE: If you don't clear halt request, progarmmers can get stuck.
//	MCF.WriteReg32( dev, DMCONTROL, 0x00000001 ); // Clear Halt Request.

	// After more experimentation, it appaers to work best by not clearing the halt request.

	MCF.FlushLLCommands( dev );
	if( MCF.DelayUS )
		MCF.DelayUS( dev, 20000 );
	else
	{
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
		Sleep(20);
#else
		usleep(20000);
#endif
	}

	if( timeout == max_timeout ) 
	{
		fprintf( stderr, "Timed out trying to unbrick\n" );
		return -5;
	}
	MCF.Erase( dev, 0, 0, 1);
	MCF.FlushLLCommands( dev );
	return -5;
}

int DefaultConfigureNRSTAsGPIO( void * dev, int one_if_yes_gpio  )
{
	fprintf( stderr, "Error: DefaultConfigureNRSTAsGPIO does not work via the programmer here.  Please see the demo \"optionbytes\"\n" );
	return -5;
#if 0
	int ret = 0;
	uint32_t csw;


	if( MCF.ReadWord( dev, 0x1FFFF800, &csw ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	printf( "CSW WAS : %08x\n", csw );

	MCF.WriteWord( dev, 0x40022008, 0x45670123 ); // OBKEYR = 0x40022008
	MCF.WriteWord( dev, 0x40022008, 0xCDEF89AB );
	MCF.WriteWord( dev, 0x40022004, 0x45670123 ); // FLASH->KEYR = 0x40022004
	MCF.WriteWord( dev, 0x40022004, 0xCDEF89AB );
	MCF.WriteWord( dev, 0x40022024, 0x45670123 ); // MODEKEYR = 0x40022024
	MCF.WriteWord( dev, 0x40022024, 0xCDEF89AB );

//XXXX THIS DOES NOT WORK IT CANNOT ERASE.
	uint32_t ctlr;
	if( MCF.ReadWord( dev, 0x40022010, &ctlr ) ) // FLASH->CTLR = 0x40022010
	{
		return -9;
	}
	ctlr |= CR_OPTER_Set | CR_STRT_Set; // OBER
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );

	MCF.WriteHalfWord( dev, (intptr_t)&OB->RDPR, RDP_Key );

    ctlr &=~CR_OPTER_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );
    ctlr |= CR_OPTPG_Set;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );
    ctlr &=~CR_OPTPG_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );


// This does work to write the option bytes, but does NOT work to erase.

	if( MCF.ReadWord( dev, 0x40022010, &ctlr ) ) // FLASH->CTLR = 0x40022010
	{
		return -9;
	}
	ctlr |= CR_OPTPG_Set; //OBPG
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );

	uint32_t config = OB_IWDG_HW | OB_STOP_NoRST | OB_STDBY_NoRST | (one_if_yes_gpio?OB_RST_NoEN:OB_RST_EN_DT1ms) | (uint16_t)0xE0;
	printf( "Config (%08x): %08x\n", (intptr_t)&OB->USER, config );
	MCF.WriteHalfWord( dev,  (intptr_t)&OB->USER, config );

	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );

	ctlr &= CR_OPTPG_Reset;
	MCF.WriteWord( dev, 0x40022010, ctlr ); // FLASH->CTLR = 0x40022010


	if( MCF.ReadWord( dev, 0x1FFFF800, &csw ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	//csw >>= 16; // Only want bottom part of word.
	printf( "CSW: %08x\n", csw );

#if 0
	uint32_t prevuser;
	if( MCF.ReadWord( dev, 0x1FFFF800, &prevuser ) )
	{
		fprintf( stderr, "Error: failed to get user word\n" );
		return -5;
	}

	ret |= MCF.WaitForFlash( dev );

	// Erase.
	MCF.ReadWord( dev, 0x40022010, &csw ); // FLASH->CTLR = 0x40022010
	csw |= 1<<5;//OBER;
	MCF.WriteWord( dev, 0x40022010, csw ); // FLASH->CTLR = 0x40022010
	MCF.WriteHalfWord( dev, 0x1FFFF802, 0xffff );
	ret |= MCF.WaitForDoneOp( dev, 0 );
	ret |= MCF.WaitForFlash( dev );

	MCF.ReadWord( dev, 0x40022010, &csw ); // FLASH->CTLR = 0x40022010
	printf( "CTLR: %08x\n", csw );
	csw |= 1<<9;//OBPG, OBWRE
	MCF.WriteWord( dev, 0x40022010, csw );

	int j;
	for( j = 0; j < 5; j++ )
	{
		if( MCF.ReadWord( dev, 0x1FFFF800, &prevuser ) )
		{
			fprintf( stderr, "Error: failed to get user word\n" );
			return -5;
		}

		//csw >>= 16; // Only want bottom part of word.
		printf( "CSW was: %08x\n", prevuser );
		csw = prevuser >> 16;
		csw = csw & 0xe7e7;
		csw |= (one_if_yes_gpio?0b11:0b00)<<(3+0);
		csw |= (one_if_yes_gpio?0b00:0b11)<<(3+8);
		printf( "CSW writing: %08x\n", csw );
		MCF.WriteHalfWord( dev, 0x1FFFF802, csw );
		ret |= MCF.WaitForDoneOp( dev, 0 );
		ret |= MCF.WaitForFlash( dev );
	}


